vowels = {
  'ʌ': 'ʌ', 'ɑ': 'ʌ',
  'ɪ': 'ɪ', 'i': 'ɪ',
  'ɛ': 'ɛ', 'e': 'ɛ',
  'æ': 'æ', 'a': 'æ',
  'ɚ': 'ɚ',
  'u': 'u', 'ʊ': 'u',
  'ɔ': 'ɔ', 'o': 'ɔ',
  'Ɛ': 'Ɛ', 'Ӕ': 'Ӕ', 'Ɔ': 'Ɔ', 'U': 'U', 'Ɪ': 'Ɪ', 'Ʌ': 'Ʌ', 'Ə': 'Ə',
}
consonants = {
  't': 't', 'd': 't',
  'n': 'n',
  's': 's', 'z': 's',
  'ɹ': 'ɹ', 'r': 'ɹ',
  'l': 'l',
  'k': 'k', 'g': 'k',
  'm': 'm',
  'θ': 'θ', 'ð': 'θ',
  'p': 'p', 'b': 'p',
  'f': 'f', 'v': 'f',
  'ʃ': 'ʃ', 'ʒ': 'ʃ',
  'h': 'h',
  'ŋ': 'ŋ',
  'ʧ': 'ʧ', 'ʤ': 'ʧ',
}

diphthongs = {
"ej": "Ɛ", "wɛ": "Ɛ", "we": "Ɛ", "jɛ": "Ɛ", "uɛ": "Ɛ", "iɛ": "Ɛ",
"aj": "Ӕ", "aw": "Ӕ", "wa": "Ӕ", "jæ": "Ӕ",
"ow": "Ɔ", "wɔ": "Ɔ", "ɔj": "Ɔ", "jɔ": "Ɔ",
"ju": "U", "wʊ": "U", "jʊ": "U",
"wɪ": "Ɪ", "wi": "Ɪ", "jɪ": "Ɪ", "iɪ": "Ɪ", "iʌ": "Ɪ", "uɪ": "Ɪ",
"wʌ": "Ʌ", "jʌ": "Ʌ", "wɑ": "Ʌ", "ʌw": "Ʌ", "uʌ": "Ʌ",
"wɚ": "Ə", "jɚ": "Ə",
}

triphthongs = {
"waj": "Ӕ",
"wej": "Ɛ",
}


diphthong_to_vowel = {
'Ɛ': 'ɛ',
'Ӕ': 'æ',
'Ɔ': 'ɔ',
'U': 'u',
'Ɪ': 'ɪ',
'Ʌ': 'ʌ',
'Ə': 'ɚ',
}
